
import { useState } from 'react';
import './App.css'
import { Sticky, StickyGroup } from './core'

function App() {
  const [show, setShow] = useState(false);

  return (
    <div className='page'>
      <StickyGroup offsetTop={0}>
        <Sticky stickyKey='a'>
          <div style={{ background: 'yellow' }}>a</div>
        </Sticky>
        <div>dkfljadkfjkdsjkfljad觉得风口浪尖圣诞节疯狂啦江东父老科技大饭卡里结算单咖啡机乐卡师傅卡进度发</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <Sticky stickyKey='b' >
          <div style={{ background: 'blue' }} >b</div>
          <div style={{ background: 'blue' }} >d</div>
        </Sticky>
        <div>dkfljadkfjkdsjkfljad觉得风口浪尖圣诞节疯狂啦江东父老科技大饭卡里结算单咖啡机乐卡师傅卡进度发</div>
          <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
          <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
          <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
          <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
          <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
          <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
          <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
          <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
          <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
          <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
          <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
          <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <Sticky stickyKey='c'>
          <div style={{ background: 'green' }}>c</div>
        </Sticky>
        <div>dkfljadkfjkdsjkfljad觉得风口浪尖圣诞节疯狂啦江东父老科技大饭卡里结算单咖啡机乐卡师傅卡进度发</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <div>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</div>
        <button onClick={() => setShow(!show)}>show</button>
        {show && (
          <>
            <Sticky stickyKey='d' >
              <div style={{ background: 'red' }} >b</div>
              <div style={{ background: 'red' }} >d</div>
            </Sticky>
            <p>{show} 123拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
            <p>{show} 123拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
            <p>{show} 123拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
            <p>{show} 123拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
            <p>{show} 123拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
            <p>{show} 123拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
            <p>{show} 123拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
            <p>{show} 123拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
            <p>{show} 123拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
            <p>{show} 123拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
            <p>{show} 123拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
            <p>{show} 123拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          </>
        )}
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <div>
            <div>
              <Sticky stickyKey='e' >
                <div style={{ background: 'purple' }} >e</div>
                <div style={{ background: 'purple' }} >e</div>
              </Sticky>
            </div>
          </div>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
          <p>拉家带口发链接啊哈哈哈卡京东方跨境电商看发了三等奖付了款</p>
      </StickyGroup>
    </div>
  )
}

export default App
